app/Controllers/User/Home.php

    public function index()
    {
        // === KATEGORI + SUBKATEGORI ===
        $kategori = $this->kategori
            ->select('
                kategori.*,
                GROUP_CONCAT(sub_kategori.nama_sub_kategori SEPARATOR ", ") as sub_list
            ')
            ->join('sub_kategori', 'sub_kategori.id_kategori = kategori.id_kategori', 'left')
            ->groupBy('kategori.id_kategori')
            ->findAll();

        return view('user/home', $this->data + [

            // POPULAR
            'popular' => $this->produk
                ->getWithLokasi()
                ->where('produk.status', 'aktif')
                ->where('produk.is_popular', 1)
                ->findAll(),

            // KATEGORI
            'kategori' => $kategori,

            // CAMERA
            'kamera' => $this->produk
                ->getWithLokasi()
                ->where('produk.status', 'aktif')
                ->where('produk.id_kategori', 1)
                ->findAll(),

            // === LIGHTING
            'lighting' => $this->produk
                ->getWithLokasi()
                ->where('produk.status', 'aktif')
                ->where('produk.id_kategori', 2)
                ->findAll(),

            // === MODIFIER ===
            'modifier' => $this->produk
                ->getWithLokasi()
                ->where('produk.status', 'aktif')
                ->where('produk.id_kategori', 3)
                ->findAll(),
---
SELECT `kategori`.*, GROUP_CONCAT(sub_kategori.nama_sub_kategori SEPARATOR ", ") as sub_list
FROM `kategori`
LEFT JOIN `sub_kategori` ON `sub_kategori`.`id_kategori` = `kategori`.`id_kategori`
GROUP BY `kategori`.`id_kategori`
SELECT `produk`.*, `lokasi`.`nama_lokasi`
FROM `produk`
LEFT JOIN `lokasi` ON `lokasi`.`id_lokasi` = `produk`.`id_lokasi`
WHERE `produk`.`status` = 'aktif'
AND `produk`.`is_popular` = 1
SELECT `produk`.*, `lokasi`.`nama_lokasi`
FROM `produk`
LEFT JOIN `lokasi` ON `lokasi`.`id_lokasi` = `produk`.`id_lokasi`
WHERE `produk`.`status` = 'aktif'
AND `produk`.`id_kategori` = 1
SELECT `produk`.*, `lokasi`.`nama_lokasi`
FROM `produk`
LEFT JOIN `lokasi` ON `lokasi`.`id_lokasi` = `produk`.`id_lokasi`
WHERE `produk`.`status` = 'aktif'
AND `produk`.`id_kategori` = 2
SELECT `produk`.*, `lokasi`.`nama_lokasi`
FROM `produk`
LEFT JOIN `lokasi` ON `lokasi`.`id_lokasi` = `produk`.`id_lokasi`
WHERE `produk`.`status` = 'aktif'
AND `produk`.`id_kategori` = 3