app/Controllers/User/Produk.php

public function lokasi($id)
    {
        $lokasiModel  = new \App\Models\LokasiModel();
        $koleksiModel = new \App\Models\KoleksiModel();

        $lokasiAktif = $lokasiModel->find($id);
        if (!$lokasiAktif) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $produk = $this->produkModel
            ->where('id_lokasi', $id)
            ->where('status', 'aktif')
            ->findAll();

        $koleksiIds = [];
        if (session()->get('logged_in')) {
---
SELECT *
FROM `produk`
WHERE `id_lokasi` = '5'
AND `status` = 'aktif'
SELECT *
FROM `lokasi`
WHERE `lokasi`.`id_lokasi` = '5'