app/Controllers/AuthController.php

        $userId = user_id();
        $db = \Config\Database::connect();

        $adminGroup = $db->table('auth_groups_users gu')
            ->select('g.name')
            ->join('auth_groups g', 'g.id = gu.group_id')
            ->where('gu.user_id', $userId)
            ->where('g.name', 'admin')
            ->get()
            ->getRowArray();
---
SELECT `g`.`name`
FROM `auth_groups_users` `gu`
JOIN `auth_groups` `g` ON `g`.`id` = `gu`.`group_id`
WHERE `gu`.`user_id` = '20'
AND `g`.`name` = 'admin'