app/Controllers/BaseController.php

    public function initController(
        \CodeIgniter\HTTP\RequestInterface $request,
        \CodeIgniter\HTTP\ResponseInterface $response,
        \Psr\Log\LoggerInterface $logger
    ) {
        parent::initController($request, $response, $logger);

        // 🔥 DATA GLOBAL HEADER (LOKASI)
        $lokasiModel = new LokasiModel();
        $this->data['lokasi'] = $lokasiModel->findAll();

        // 🔥 BADGE KOLEKSI
        if (session()->get('logged_in')) {
            $koleksiModel = new KoleksiModel();
            $this->data['jumlahKoleksi'] = $koleksiModel
                ->where('id_user', session()->get('user_id'))
                ->countAllResults();
---
SELECT *
FROM `lokasi`
SELECT COUNT(*) AS `numrows`
FROM `koleksi`
WHERE `id_user` IS NULL